
5W2H分析法 - 七问分析法
		
		问题的线索，发明的思路，设计的构思

WHAT		是什么？目的是什么？做什么工作？
	
WHY			为什么要做？可不可以不做？有没有替代方案？

WHO			谁？由谁来做？

WHEN		何时？什么时间做？什么时机最适宜？

WHERE		何处？在哪里做？

HOW			怎么做？如何提高效率？如何实施？方法是什么？

HOW MUCH	多少？做到什么程度？数量如何？质量水平如何？费用产出如何？


例：
检查原产品的合理性

步骤（1）做什么（What）？
条件是什么？哪一部分工作要做？目的是什么？重点是什么？与什么有关系？功能是什么？规范是什么？工作对象是什么？

步骤（2） 怎样（How）？
怎样做省力？怎样做最快？怎样做效率最高？怎样改进？怎样得到？怎样避免失败？怎样求发展？怎样增加销路？怎样达到效率？怎样才能使产品更加美观大方？怎样使产品用起来方便？

步骤（3）为什么（why）？
为什么采用这个技术参数？为什么不能有响声？为什么停用？为什么变成红色：为什么要做成这个形状？为什么采用机器代替人力？为什么产品的制造要经过这么多环节？为什么非做不可？

步骤（4）何时（when）？
何时要完成？何时安装？何时销售？何时是最佳营业时间？何时工作人员容易疲劳？何时产量最高？何时完成最为时宜？需要几天才算合理？

步骤（5）何地（where）？
何地最适宜某物生长？何处生产最经济？从何处买？还有什么地方可以作销售点？安装在什么地方最合适？何地有资源？

步骤（6） 谁（who）？
谁来办最方便？谁会生产？谁可以办？谁是顾客？谁被忽略了？谁是决策人？谁会受益？

步骤（7）多少（How much）？
功能指标达到多少？销售多少？成本多少？输出功率多少？效率多高？尺寸多少？重量多少？


